#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_registry.aks-bcdr will be created
  + resource "azurerm_container_registry" "aks-bcdr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + georeplication_locations      = (known after apply)
      + georeplications               = (known after apply)
      + id                            = (known after apply)
      + location                      = "northeurope"
      + login_server                  = (known after apply)
      + name                          = "aksbcdracr"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "aksbcdrrg"
      + retention_policy              = (known after apply)
      + sku                           = "Standard"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # azurerm_key_vault.aks-bcdr will be created
  + resource "azurerm_key_vault" "aks-bcdr" {
      + access_policy               = [
          + {
              + application_id          = null
              + certificate_permissions = null
              + key_permissions         = [
                  + "create",
                  + "get",
                ]
              + object_id               = "33829b80-d720-4f93-870b-e77e121840c1"
              + secret_permissions      = [
                  + "set",
                  + "get",
                  + "delete",
                  + "purge",
                  + "recover",
                ]
              + storage_permissions     = [
                  + "Get",
                ]
              + tenant_id               = "72f988bf-86f1-41af-91ab-2d7cd011db47"
            },
        ]
      + enabled_for_disk_encryption = true
      + id                          = (known after apply)
      + location                    = "northeurope"
      + name                        = "aksbcdrkeyvault"
      + purge_protection_enabled    = false
      + resource_group_name         = "aksbcdrrg"
      + sku_name                    = "standard"
      + soft_delete_enabled         = (known after apply)
      + soft_delete_retention_days  = 7
      + tenant_id                   = "72f988bf-86f1-41af-91ab-2d7cd011db47"
      + vault_uri                   = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_key_vault_access_policy.aks-bcdr will be created
  + resource "azurerm_key_vault_access_policy" "aks-bcdr" {
      + id                  = (known after apply)
      + key_permissions     = [
          + "Get",
          + "List",
        ]
      + key_vault_id        = (known after apply)
      + object_id           = (known after apply)
      + secret_permissions  = [
          + "Get",
          + "List",
        ]
      + storage_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id           = "72f988bf-86f1-41af-91ab-2d7cd011db47"
    }

  # azurerm_key_vault_secret.aks-bcdr will be created
  + resource "azurerm_key_vault_secret" "aks-bcdr" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "mysqlpass"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_kubernetes_cluster.aks-bcdr will be created
  + resource "azurerm_kubernetes_cluster" "aks-bcdr" {
      + dns_prefix                          = "aksbcdr"
      + fqdn                                = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (known after apply)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (known after apply)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.21.1"
      + location                            = "northeurope"
      + name                                = "aksbcdr"
      + node_resource_group                 = (known after apply)
      + private_cluster_enabled             = (known after apply)
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + private_link_enabled                = (known after apply)
      + resource_group_name                 = "aksbcdrrg"
      + sku_tier                            = "Free"

      + addon_profile {
          + aci_connector_linux {
              + enabled     = (known after apply)
              + subnet_name = (known after apply)
            }

          + azure_policy {
              + enabled = (known after apply)
            }

          + http_application_routing {
              + enabled                            = (known after apply)
              + http_application_routing_zone_name = (known after apply)
            }

          + ingress_application_gateway {
              + effective_gateway_id                 = (known after apply)
              + enabled                              = (known after apply)
              + gateway_id                           = (known after apply)
              + gateway_name                         = (known after apply)
              + ingress_application_gateway_identity = (known after apply)
              + subnet_cidr                          = (known after apply)
              + subnet_id                            = (known after apply)
            }

          + kube_dashboard {
              + enabled = (known after apply)
            }

          + oms_agent {
              + enabled                    = (known after apply)
              + log_analytics_workspace_id = (known after apply)
              + oms_agent_identity         = (known after apply)
            }
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + default_node_pool {
          + availability_zones    = [
              + "1",
              + "2",
              + "3",
            ]
          + enable_node_public_ip = false
          + kubelet_disk_type     = (known after apply)
          + max_pods              = (known after apply)
          + name                  = "default"
          + node_count            = 3
          + node_labels           = (known after apply)
          + orchestrator_version  = (known after apply)
          + os_disk_size_gb       = 128
          + os_disk_type          = "Managed"
          + type                  = "VirtualMachineScaleSets"
          + ultra_ssd_enabled     = false
          + vm_size               = "Standard_D2_v2"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + network_profile {
          + dns_service_ip     = "10.1.0.10"
          + docker_bridge_cidr = "172.17.0.1/24"
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = "calico"
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + service_cidr       = "10.1.0.0/24"

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = (known after apply)

          + azure_active_directory {
              + admin_group_object_ids = (known after apply)
              + azure_rbac_enabled     = (known after apply)
              + client_app_id          = (known after apply)
              + managed                = (known after apply)
              + server_app_id          = (known after apply)
              + server_app_secret      = (sensitive value)
              + tenant_id              = (known after apply)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
          + license        = (known after apply)
        }
    }

  # azurerm_resource_group.aks-bcdr will be created
  + resource "azurerm_resource_group" "aks-bcdr" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "aksbcdrrg"
    }

  # azurerm_role_assignment.aks_acr will be created
  + resource "azurerm_role_assignment" "aks_acr" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.aks_subnet will be created
  + resource "azurerm_role_assignment" "aks_subnet" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_subnet.aks-bcdr will be created
  + resource "azurerm_subnet" "aks-bcdr" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.0.0.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "aksbcdrsubnet"
      + resource_group_name                            = "aksbcdrrg"
      + virtual_network_name                           = "aksbcdrvnet"
    }

  # azurerm_virtual_network.aks-bcdr will be created
  + resource "azurerm_virtual_network" "aks-bcdr" {
      + address_space         = [
          + "10.0.0.0/16",
        ]
      + dns_servers           = (known after apply)
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "northeurope"
      + name                  = "aksbcdrvnet"
      + resource_group_name   = "aksbcdrrg"
      + subnet                = (known after apply)
      + vm_protection_enabled = false
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Action`, Action: `__hashicorp_terraform-github-actions_3`, Working Directory: `./`, Workspace: `default`*
